In [1]:
%pip install pandas

Requirement already satisfied: pandas in /home/codespace/.local/lib/python3.12/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2.1.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in /home/codespace/.local/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [2]:
# Create pandas data table
import pandas as pd

Student = pd.DataFrame(
    {
            "name":["Suryansh","Ganesh","Aakash",None,"Vakhya"]  ,
            "age":  [20,24,26,None,24]  ,
            "state": ["MP","MP","MP",None,"MP"]  ,
            "semester":["3rd","6th","Passout",None,"7th"]  ,
    }
    )
print(Student)

       name   age state semester
0  Suryansh  20.0    MP      3rd
1    Ganesh  24.0    MP      6th
2    Aakash  26.0    MP  Passout
3      None   NaN  None     None
4    Vakhya  24.0    MP      7th

In [3]:
Student["name"]

0    Suryansh
1      Ganesh
2      Aakash
3        None
4      Vakhya
Name: name, dtype: object

In [4]:
Student["age"]

0    20.0
1    24.0
2    26.0
3     NaN
4    24.0
Name: age, dtype: float64

In [5]:
Student["age"].unique() # select distinct age from Student

array([20., 24., 26., nan])

In [6]:
Student.head(5)

       name   age state semester
0  Suryansh  20.0    MP      3rd
1    Ganesh  24.0    MP      6th
2    Aakash  26.0    MP  Passout
3      None   NaN  None     None
4    Vakhya  24.0    MP      7th

In [7]:
Student.head(3) # select * from Student limit 3

       name   age state semester
0  Suryansh  20.0    MP      3rd
1    Ganesh  24.0    MP      6th
2    Aakash  26.0    MP  Passout

In [8]:
Student.tail(3) # select * from Student order by key limit 2

     name   age state semester
2  Aakash  26.0    MP  Passout
3    None   NaN  None     None
4  Vakhya  24.0    MP      7th

In [9]:
Student["age"].mean() # Select avg(age) from Student

np.float64(23.5)

In [10]:
Student["age"].count() #select count(age) from Student

np.int64(4)

In [11]:
Student.describe()

             age
count   4.000000
mean   23.500000
std     2.516611
min    20.000000
25%    23.000000
50%    24.000000
75%    24.500000
max    26.000000

In [12]:
Student.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      4 non-null      object
 1   age       4 non-null      float64
 2   state     4 non-null      object
 3   semester  4 non-null      object
dtypes: float64(1), object(3)
memory usage: 292.0+ bytes

In [13]:
Student.isnull().sum() # select count(*) from Student where key is null;

name        1
age         1
state       1
semester    1
dtype: int64

In [14]:
Student["age"].fillna(Student["age"].median())

0    20.0
1    24.0
2    26.0
3    24.0
4    24.0
Name: age, dtype: float64

In [15]:
Student

       name   age state semester
0  Suryansh  20.0    MP      3rd
1    Ganesh  24.0    MP      6th
2    Aakash  26.0    MP  Passout
3      None   NaN  None     None
4    Vakhya  24.0    MP      7th

In [16]:
Student["age"] = Student["age"].fillna(Student["age"].median())

In [17]:
Student

       name   age state semester
0  Suryansh  20.0    MP      3rd
1    Ganesh  24.0    MP      6th
2    Aakash  26.0    MP  Passout
3      None  24.0  None     None
4    Vakhya  24.0    MP      7th

In [18]:
Student["state"].ffill()

0    MP
1    MP
2    MP
3    MP
4    MP
Name: state, dtype: object

In [19]:
Student["state"] = Student["state"].ffill()

In [20]:
Student

       name   age state semester
0  Suryansh  20.0    MP      3rd
1    Ganesh  24.0    MP      6th
2    Aakash  26.0    MP  Passout
3      None  24.0    MP     None
4    Vakhya  24.0    MP      7th

In [21]:
Student["semester"].bfill()

0        3rd
1        6th
2    Passout
3        7th
4        7th
Name: semester, dtype: object

In [22]:
Student["semester"] = Student["semester"].bfill()

In [23]:
Student

       name   age state semester
0  Suryansh  20.0    MP      3rd
1    Ganesh  24.0    MP      6th
2    Aakash  26.0    MP  Passout
3      None  24.0    MP      7th
4    Vakhya  24.0    MP      7th

In [24]:
Student["name"] = Student["name"].bfill()

In [25]:
Student

       name   age state semester
0  Suryansh  20.0    MP      3rd
1    Ganesh  24.0    MP      6th
2    Aakash  26.0    MP  Passout
3    Vakhya  24.0    MP      7th
4    Vakhya  24.0    MP      7th

In [27]:
Student.duplicated().sum()

np.int64(1)

In [28]:
Student.drop_duplicates()

       name   age state semester
0  Suryansh  20.0    MP      3rd
1    Ganesh  24.0    MP      6th
2    Aakash  26.0    MP  Passout
3    Vakhya  24.0    MP      7th

In [29]:
Student = Student.drop_duplicates()

In [30]:
Student

       name   age state semester
0  Suryansh  20.0    MP      3rd
1    Ganesh  24.0    MP      6th
2    Aakash  26.0    MP  Passout
3    Vakhya  24.0    MP      7th

In [32]:
Student.to_csv("Student.csv",columns=["name","age","state","semester"])

In [34]:
%pip install openpyxl
Student.to_excel("Student.xlsx")

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.